NordicSemiconductor/nrfx/mdk/nrf54h20_engb_application.h
/* ========================================= Start of section using anonymous unions ========================================= */

#include "compiler_abstraction.h"

#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Unsupported compiler type
#endif

/* =========================================================================================================================== */
/* ================                                  Peripheral Address Map                                  ================ */
/* =========================================================================================================================== */

#define NRF_APPLICATION_UICREXTENDED_NS_BASE 0x00000000UL
#define NRF_APPLICATION_ICACHEDATA_S_BASE 0x02F00000UL
#define NRF_APPLICATION_ICACHEINFO_S_BASE 0x02F10000UL
#define NRF_APPLICATION_UICR_NS_BASE      0x0FFF8000UL
#define NRF_APPLICATION_BICR_NS_BASE      0x0FFF87B0UL
#define NRF_APPLICATION_DCACHEDATA_S_BASE 0x22F00000UL
#define NRF_APPLICATION_DCACHEINFO_S_BASE 0x22F10000UL
#define NRF_APPLICATION_ETM_NS_BASE       0xE0041000UL
#define NRF_APPLICATION_CTI_S_BASE        0xE0042000UL
#define NRF_APPLICATION_ICACHE_S_BASE     0xE0082000UL
#define NRF_APPLICATION_DCACHE_S_BASE     0xE0083000UL
#define NRF_APPLICATION_SPU000_S_BASE     0x52000000UL
#define NRF_APPLICATION_MPC_S_BASE        0x52001000UL
#define NRF_APPLICATION_CPUC_S_BASE       0xE0080000UL
#define NRF_APPLICATION_MVDMA_NS_BASE     0x42003000UL
#define NRF_APPLICATION_MVDMA_S_BASE      0x52003000UL
#define NRF_APPLICATION_RAMC_NS_BASE      0x42004000UL
#define NRF_APPLICATION_RAMC_S_BASE       0x52004000UL
#define NRF_APPLICATION_HSFLL_S_BASE      0x5200D000UL
#define NRF_APPLICATION_LRCCONF000_S_BASE 0x5200E000UL
#define NRF_APPLICATION_SPU010_S_BASE     0x52010000UL
#define NRF_APPLICATION_MEMCONF_NS_BASE   0x42012000UL
#define NRF_APPLICATION_MEMCONF_S_BASE    0x52012000UL
#define NRF_APPLICATION_WDT010_NS_BASE    0x42014000UL
#define NRF_APPLICATION_WDT010_S_BASE     0x52014000UL
#define NRF_APPLICATION_WDT011_NS_BASE    0x42015000UL
#define NRF_APPLICATION_WDT011_S_BASE     0x52015000UL
#define NRF_APPLICATION_ABB_S_BASE        0x5201C000UL
#define NRF_APPLICATION_LRCCONF010_S_BASE 0x5201E000UL
#define NRF_APPLICATION_RESETINFO_S_BASE  0x5201E000UL
#define NRF_APPLICATION_IPCT_NS_BASE      0x42013000UL
#define NRF_APPLICATION_IPCT_S_BASE       0x52013000UL
#define NRF_APPLICATION_SWI0_NS_BASE      0x42058000UL
#define NRF_APPLICATION_SWI1_NS_BASE      0x42059000UL
#define NRF_APPLICATION_SWI2_NS_BASE      0x4205A000UL
#define NRF_APPLICATION_SWI3_NS_BASE      0x4205B000UL
#define NRF_APPLICATION_SWI4_NS_BASE      0x4205C000UL
#define NRF_APPLICATION_SWI5_NS_BASE      0x4205D000UL
#define NRF_APPLICATION_SWI6_NS_BASE      0x4205E000UL
#define NRF_APPLICATION_SWI7_NS_BASE      0x4205F000UL
#define NRF_APPLICATION_BELLBOARD_NS_BASE 0x4F09A000UL
#define NRF_APPLICATION_BELLBOARD_S_BASE  0x5F09A000UL

/* =========================================================================================================================== */
/* ================                                  Peripheral Declaration                                  ================ */
/* =========================================================================================================================== */

#define NRF_APPLICATION_UICREXTENDED_NS   ((NRF_UICREXTENDED_Type*)             NRF_APPLICATION_UICREXTENDED_NS_BASE)
#define NRF_APPLICATION_ICACHEDATA_S      ((NRF_ICACHEDATA_Type*)               NRF_APPLICATION_ICACHEDATA_S_BASE)
#define NRF_APPLICATION_ICACHEINFO_S      ((NRF_ICACHEINFO_Type*)               NRF_APPLICATION_ICACHEINFO_S_BASE)
#define NRF_APPLICATION_UICR_NS           ((NRF_UICR_Type*)                     NRF_APPLICATION_UICR_NS_BASE)
#define NRF_APPLICATION_BICR_NS           ((NRF_BICR_Type*)                     NRF_APPLICATION_BICR_NS_BASE)
#define NRF_APPLICATION_DCACHEDATA_S      ((NRF_DCACHEDATA_Type*)               NRF_APPLICATION_DCACHEDATA_S_BASE)
#define NRF_APPLICATION_DCACHEINFO_S      ((NRF_DCACHEINFO_Type*)               NRF_APPLICATION_DCACHEINFO_S_BASE)
#define NRF_APPLICATION_ETM_NS            ((NRF_ETM_Type*)                      NRF_APPLICATION_ETM_NS_BASE)
#define NRF_APPLICATION_CTI_S             ((NRF_CTI_Type*)                      NRF_APPLICATION_CTI_S_BASE)
#define NRF_APPLICATION_ICACHE_S          ((NRF_CACHE_Type*)                    NRF_APPLICATION_ICACHE_S_BASE)
#define NRF_APPLICATION_DCACHE_S          ((NRF_CACHE_Type*)                    NRF_APPLICATION_DCACHE_S_BASE)
#define NRF_APPLICATION_SPU000_S          ((NRF_SPU_Type*)                      NRF_APPLICATION_SPU000_S_BASE)
#define NRF_APPLICATION_MPC_S             ((NRF_MPC_Type*)                      NRF_APPLICATION_MPC_S_BASE)
#define NRF_APPLICATION_CPUC_S            ((NRF_CM33SS_Type*)                   NRF_APPLICATION_CPUC_S_BASE)
#define NRF_APPLICATION_MVDMA_NS          ((NRF_MVDMA_Type*)                    NRF_APPLICATION_MVDMA_NS_BASE)
#define NRF_APPLICATION_MVDMA_S           ((NRF_MVDMA_Type*)                    NRF_APPLICATION_MVDMA_S_BASE)
#define NRF_APPLICATION_RAMC_NS           ((NRF_RAMC_Type*)                     NRF_APPLICATION_RAMC_NS_BASE)
#define NRF_APPLICATION_RAMC_S            ((NRF_RAMC_Type*)                     NRF_APPLICATION_RAMC_S_BASE)
#define NRF_APPLICATION_HSFLL_S           ((NRF_HSFLL_Type*)                    NRF_APPLICATION_HSFLL_S_BASE)
#define NRF_APPLICATION_LRCCONF000_S      ((NRF_LRCCONF_Type*)                  NRF_APPLICATION_LRCCONF000_S_BASE)
#define NRF_APPLICATION_SPU010_S          ((NRF_SPU_Type*)                      NRF_APPLICATION_SPU010_S_BASE)
#define NRF_APPLICATION_MEMCONF_NS        ((NRF_MEMCONF_Type*)                  NRF_APPLICATION_MEMCONF_NS_BASE)
#define NRF_APPLICATION_MEMCONF_S         ((NRF_MEMCONF_Type*)                  NRF_APPLICATION_MEMCONF_S_BASE)
#define NRF_APPLICATION_WDT010_NS         ((NRF_WDT_Type*)                      NRF_APPLICATION_WDT010_NS_BASE)
#define NRF_APPLICATION_WDT010_S          ((NRF_WDT_Type*)                      NRF_APPLICATION_WDT010_S_BASE)
#define NRF_APPLICATION_WDT011_NS         ((NRF_WDT_Type*)                      NRF_APPLICATION_WDT011_NS_BASE)
#define NRF_APPLICATION_WDT011_S          ((NRF_WDT_Type*)                      NRF_APPLICATION_WDT011_S_BASE)
#define NRF_APPLICATION_ABB_S             ((NRF_ABB_Type*)                      NRF_APPLICATION_ABB_S_BASE)
#define NRF_APPLICATION_LRCCONF010_S      ((NRF_LRCCONF_Type*)                  NRF_APPLICATION_LRCCONF010_S_BASE)
#define NRF_APPLICATION_RESETINFO_S       ((NRF_RESETINFO_Type*)                NRF_APPLICATION_RESETINFO_S_BASE)
#define NRF_APPLICATION_IPCT_NS           ((NRF_IPCT_Type*)                     NRF_APPLICATION_IPCT_NS_BASE)
#define NRF_APPLICATION_IPCT_S            ((NRF_IPCT_Type*)                     NRF_APPLICATION_IPCT_S_BASE)
#define NRF_APPLICATION_SWI0_NS           ((NRF_SWI_Type*)                      NRF_APPLICATION_SWI0_NS_BASE)
#define NRF_APPLICATION_SWI1_NS           ((NRF_SWI_Type*)                      NRF_APPLICATION_SWI1_NS_BASE)
#define NRF_APPLICATION_SWI2_NS           ((NRF_SWI_Type*)                      NRF_APPLICATION_SWI2_NS_BASE)
#define NRF_APPLICATION_SWI3_NS           ((NRF_SWI_Type*)                      NRF_APPLICATION_SWI3_NS_BASE)
#define NRF_APPLICATION_SWI4_NS           ((NRF_SWI_Type*)                      NRF_APPLICATION_SWI4_NS_BASE)
#define NRF_APPLICATION_SWI5_NS           ((NRF_SWI_Type*)                      NRF_APPLICATION_SWI5_NS_BASE)
#define NRF_APPLICATION_SWI6_NS           ((NRF_SWI_Type*)                      NRF_APPLICATION_SWI6_NS_BASE)
#define NRF_APPLICATION_SWI7_NS           ((NRF_SWI_Type*)                      NRF_APPLICATION_SWI7_NS_BASE)
#define NRF_APPLICATION_BELLBOARD_NS      ((NRF_BELLBOARD_Type*)                NRF_APPLICATION_BELLBOARD_NS_BASE)
#define NRF_APPLICATION_BELLBOARD_S       ((NRF_BELLBOARD_Type*)                NRF_APPLICATION_BELLBOARD_S_BASE)

/* =========================================================================================================================== */
/* ================                                    TrustZone Remapping                                    ================ */
/* =========================================================================================================================== */

