NordicSemiconductor/nrfx/mdk/nrf54h20_engb_application.h
#ifdef NRF_TRUSTZONE_NONSECURE                       /*!< Remap NRF_X_NS instances to NRF_X symbol for ease of use.            */
  #define NRF_APPLICATION_UICREXTENDED            NRF_APPLICATION_UICREXTENDED_NS
  #define NRF_APPLICATION_UICR                    NRF_APPLICATION_UICR_NS
  #define NRF_APPLICATION_BICR                    NRF_APPLICATION_BICR_NS
  #define NRF_APPLICATION_ETM                     NRF_APPLICATION_ETM_NS
  #define NRF_APPLICATION_MVDMA                   NRF_APPLICATION_MVDMA_NS
  #define NRF_APPLICATION_RAMC                    NRF_APPLICATION_RAMC_NS
  #define NRF_APPLICATION_MEMCONF                 NRF_APPLICATION_MEMCONF_NS
  #define NRF_APPLICATION_WDT010                  NRF_APPLICATION_WDT010_NS
  #define NRF_APPLICATION_WDT011                  NRF_APPLICATION_WDT011_NS
  #define NRF_APPLICATION_IPCT                    NRF_APPLICATION_IPCT_NS
  #define NRF_APPLICATION_SWI0                    NRF_APPLICATION_SWI0_NS
  #define NRF_APPLICATION_SWI1                    NRF_APPLICATION_SWI1_NS
  #define NRF_APPLICATION_SWI2                    NRF_APPLICATION_SWI2_NS
  #define NRF_APPLICATION_SWI3                    NRF_APPLICATION_SWI3_NS
  #define NRF_APPLICATION_SWI4                    NRF_APPLICATION_SWI4_NS
  #define NRF_APPLICATION_SWI5                    NRF_APPLICATION_SWI5_NS
  #define NRF_APPLICATION_SWI6                    NRF_APPLICATION_SWI6_NS
  #define NRF_APPLICATION_SWI7                    NRF_APPLICATION_SWI7_NS
  #define NRF_APPLICATION_BELLBOARD               NRF_APPLICATION_BELLBOARD_NS
#else                                                /*!< Remap NRF_X_S instances to NRF_X symbol for ease of use.             */
  #define NRF_APPLICATION_UICREXTENDED            NRF_APPLICATION_UICREXTENDED_NS
  #define NRF_APPLICATION_ICACHEDATA              NRF_APPLICATION_ICACHEDATA_S
  #define NRF_APPLICATION_ICACHEINFO              NRF_APPLICATION_ICACHEINFO_S
  #define NRF_APPLICATION_UICR                    NRF_APPLICATION_UICR_NS
  #define NRF_APPLICATION_BICR                    NRF_APPLICATION_BICR_NS
  #define NRF_APPLICATION_DCACHEDATA              NRF_APPLICATION_DCACHEDATA_S
  #define NRF_APPLICATION_DCACHEINFO              NRF_APPLICATION_DCACHEINFO_S
  #define NRF_APPLICATION_ETM                     NRF_APPLICATION_ETM_NS
  #define NRF_APPLICATION_CTI                     NRF_APPLICATION_CTI_S
  #define NRF_APPLICATION_ICACHE                  NRF_APPLICATION_ICACHE_S
  #define NRF_APPLICATION_DCACHE                  NRF_APPLICATION_DCACHE_S
  #define NRF_APPLICATION_SPU000                  NRF_APPLICATION_SPU000_S
  #define NRF_APPLICATION_MPC                     NRF_APPLICATION_MPC_S
  #define NRF_APPLICATION_CPUC                    NRF_APPLICATION_CPUC_S
  #define NRF_APPLICATION_MVDMA                   NRF_APPLICATION_MVDMA_S
  #define NRF_APPLICATION_RAMC                    NRF_APPLICATION_RAMC_S
  #define NRF_APPLICATION_HSFLL                   NRF_APPLICATION_HSFLL_S
  #define NRF_APPLICATION_LRCCONF000              NRF_APPLICATION_LRCCONF000_S
  #define NRF_APPLICATION_SPU010                  NRF_APPLICATION_SPU010_S
  #define NRF_APPLICATION_MEMCONF                 NRF_APPLICATION_MEMCONF_S
  #define NRF_APPLICATION_WDT010                  NRF_APPLICATION_WDT010_S
  #define NRF_APPLICATION_WDT011                  NRF_APPLICATION_WDT011_S
  #define NRF_APPLICATION_ABB                     NRF_APPLICATION_ABB_S
  #define NRF_APPLICATION_LRCCONF010              NRF_APPLICATION_LRCCONF010_S
  #define NRF_APPLICATION_RESETINFO               NRF_APPLICATION_RESETINFO_S
  #define NRF_APPLICATION_IPCT                    NRF_APPLICATION_IPCT_S
  #define NRF_APPLICATION_SWI0                    NRF_APPLICATION_SWI0_NS
  #define NRF_APPLICATION_SWI1                    NRF_APPLICATION_SWI1_NS
  #define NRF_APPLICATION_SWI2                    NRF_APPLICATION_SWI2_NS
  #define NRF_APPLICATION_SWI3                    NRF_APPLICATION_SWI3_NS
  #define NRF_APPLICATION_SWI4                    NRF_APPLICATION_SWI4_NS
  #define NRF_APPLICATION_SWI5                    NRF_APPLICATION_SWI5_NS
  #define NRF_APPLICATION_SWI6                    NRF_APPLICATION_SWI6_NS
  #define NRF_APPLICATION_SWI7                    NRF_APPLICATION_SWI7_NS
  #define NRF_APPLICATION_BELLBOARD               NRF_APPLICATION_BELLBOARD_S
#endif                                               /*!< NRF_TRUSTZONE_NONSECURE                                              */

/* =========================================================================================================================== */
/* ================                                  Local Domain Remapping                                  ================ */
/* =========================================================================================================================== */

#ifdef NRF_APPLICATION                               /*!< Remap NRF_DOMAIN_X instances to NRF_X symbol for ease of use.        */
  #ifdef NRF_TRUSTZONE_NONSECURE                     /*!< Remap only nonsecure instances.                                      */
    #define NRF_UICREXTENDED                      NRF_APPLICATION_UICREXTENDED
    #define NRF_UICR                              NRF_APPLICATION_UICR
    #define NRF_BICR                              NRF_APPLICATION_BICR
    #define NRF_ETM                               NRF_APPLICATION_ETM
    #define NRF_MVDMA                             NRF_APPLICATION_MVDMA
    #define NRF_RAMC                              NRF_APPLICATION_RAMC
    #define NRF_MEMCONF                           NRF_APPLICATION_MEMCONF
    #define NRF_WDT010                            NRF_APPLICATION_WDT010
    #define NRF_WDT011                            NRF_APPLICATION_WDT011
    #define NRF_IPCT                              NRF_APPLICATION_IPCT
    #define NRF_SWI0                              NRF_APPLICATION_SWI0
    #define NRF_SWI1                              NRF_APPLICATION_SWI1
    #define NRF_SWI2                              NRF_APPLICATION_SWI2
    #define NRF_SWI3                              NRF_APPLICATION_SWI3
    #define NRF_SWI4                              NRF_APPLICATION_SWI4
    #define NRF_SWI5                              NRF_APPLICATION_SWI5
    #define NRF_SWI6                              NRF_APPLICATION_SWI6
    #define NRF_SWI7                              NRF_APPLICATION_SWI7
    #define NRF_BELLBOARD                         NRF_APPLICATION_BELLBOARD
  #else                                              /*!< Remap all instances.                                                 */
    #define NRF_UICREXTENDED                      NRF_APPLICATION_UICREXTENDED
    #define NRF_ICACHEDATA                        NRF_APPLICATION_ICACHEDATA
    #define NRF_ICACHEINFO                        NRF_APPLICATION_ICACHEINFO
    #define NRF_UICR                              NRF_APPLICATION_UICR
    #define NRF_BICR                              NRF_APPLICATION_BICR
    #define NRF_DCACHEDATA                        NRF_APPLICATION_DCACHEDATA
    #define NRF_DCACHEINFO                        NRF_APPLICATION_DCACHEINFO
    #define NRF_ETM                               NRF_APPLICATION_ETM
    #define NRF_CTI                               NRF_APPLICATION_CTI
    #define NRF_ICACHE                            NRF_APPLICATION_ICACHE
    #define NRF_DCACHE                            NRF_APPLICATION_DCACHE
    #define NRF_SPU000                            NRF_APPLICATION_SPU000
    #define NRF_MPC                               NRF_APPLICATION_MPC
    #define NRF_CPUC                              NRF_APPLICATION_CPUC
    #define NRF_MVDMA                             NRF_APPLICATION_MVDMA
    #define NRF_RAMC                              NRF_APPLICATION_RAMC
    #define NRF_HSFLL                             NRF_APPLICATION_HSFLL
    #define NRF_LRCCONF000                        NRF_APPLICATION_LRCCONF000
    #define NRF_SPU010                            NRF_APPLICATION_SPU010
    #define NRF_MEMCONF                           NRF_APPLICATION_MEMCONF
    #define NRF_WDT010                            NRF_APPLICATION_WDT010
    #define NRF_WDT011                            NRF_APPLICATION_WDT011
    #define NRF_ABB                               NRF_APPLICATION_ABB
    #define NRF_LRCCONF010                        NRF_APPLICATION_LRCCONF010
    #define NRF_RESETINFO                         NRF_APPLICATION_RESETINFO
    #define NRF_IPCT                              NRF_APPLICATION_IPCT
    #define NRF_SWI0                              NRF_APPLICATION_SWI0
    #define NRF_SWI1                              NRF_APPLICATION_SWI1
    #define NRF_SWI2                              NRF_APPLICATION_SWI2
    #define NRF_SWI3                              NRF_APPLICATION_SWI3
    #define NRF_SWI4                              NRF_APPLICATION_SWI4
    #define NRF_SWI5                              NRF_APPLICATION_SWI5
    #define NRF_SWI6                              NRF_APPLICATION_SWI6
    #define NRF_SWI7                              NRF_APPLICATION_SWI7
    #define NRF_BELLBOARD                         NRF_APPLICATION_BELLBOARD
  #endif                                             /*!< NRF_TRUSTZONE_NONSECURE                                              */
#endif                                               /*!< NRF_APPLICATION                                                      */

/* ========================================== End of section using anonymous unions ========================================== */

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif
#endif /* NRF54H20_ENGB_APPLICATION_H */

